app/Http/Controllers/front/FrontController.php

select * from `homepages` limit 1
select * from `sliders` where `slider_id` = 1 limit 1
select * from `sliders` where `slider_id` = 8 limit 1
select * from `pages` where `category` = 'aktivite' limit 1
select * from `page_details` where `page_id` = 4
select * from `pages` where `is_active` = 1
select * from `rooms` order by `desk` asc
---
    public function index()
    {
        $session = app()->getLocale();
        $homepage = Homepage::first();
        $sliders = Slider::where('slider_id', 1)->first();
        $mobile_sliders = Slider::where('slider_id', 8)->first();
        $activity = Page::where('category', 'aktivite')->first();
        $activity_details = Page_detail::where('page_id', $activity->id)->get();
        $pages = Page::where('is_active', 1)->get();
        $rooms = Room::orderBy('desk', 'asc')->get();

select * from `ormanevleri_homepages` limit 1
select * from `sliders` where `slider_id` = 11 limit 1
select * from `ormanevleri_rooms` order by `desk` asc
select * from `sliders` where `slider_id` = 15
---
    public function ormanevleri()
    {
        $session = app()->getLocale();
        $homepage = Ormanevleri_homepage::first();
        $sliders = Slider::where('slider_id', 10)->first();
        $mobile_sliders = Slider::where('slider_id', 11)->first();
        $rooms = Ormanevleri_room::orderBy('desk', 'asc')->get();
        $iglo_slider = Slider::where('slider_id', 15)->get();