app/Http/Controllers/admin/AdminController.php

    public function index(){
        $room = Room::all();
        $pdfs = Pdf::all();
        $sliders = Slider::all();
---
select * from `rooms`
select * from `pdfs`
select * from `sliders`