app/Http/Controllers/admin/HomepageController.php

select * from `main_page_title_subtitle` limit 1
---
    public function index()
    {
        $data = MainPageTitleSubtitle::first();

select * from `homepages` limit 1
---
    public function update(Request $request, $id)
    {
        $all = $request->except('_token');
        $update = MainPageTitleSubtitle::find($id)->update($all);
        if ($update) {
            return redirect()->route('admin.homepage.index')->with('status', 'Başarıyla Güncellendi')->send();