app/Http/Controllers/admin/MainPageTitleSubtitleController.php

select * from `main_page_title_subtitle` where `main_page_title_subtitle`.`id` = '1' limit 1
---
    public function edit($id)
    {
        $data = MainPageTitleSubtitle::findOrFail($id); // Belirli veriyi buluyoruz

select * from `main_page_title_subtitle` where `main_page_title_subtitle`.`id` = '1' limit 1
---
    public function update(Request $request, $id)
    {
        $data = MainPageTitleSubtitle::findOrFail($id); // Veriyi buluyoruz