app/Http/Controllers/admin/OrmanEvleriRoomGalleryController.php

    public function index($id)
    {
        $data = Ormanevleri_room_gallery::where('room_id',$id)->orderBy('desk', 'asc')->get();
---
select * from `ormanevleri_room_galleries` where `room_id` = '4' order by `desk` asc

    public function store(Request $request)
    {
        $request->validate([
            'image' => 'required',
            'image.*' =>  'mimes:jpeg,png,jpg,gif,svg',

        ],
        [
            'image.required' => 'Lütfen Resim Giriniz ! ',
            'image.mimes' => 'Lütfen jpeg,jpg,png,bmp,gif,svg formatlarında dosya yükleyiniz !'

        ]);

        $all = $request->except('_token');

        if($request->has('image'))
        {
            foreach($request->file('image') as $image){
                $imageName = "images/ormanevleri-room_gallery/".rand(1,999).'-'.$image->getClientOriginalName();
                if(File::exists($imageName))
                {
                    return redirect()->to('/admin/ormanevleri-room_gallery/'.$all['room_id'])->with('status','Aynı isimde daha önce yükleme işlemi yapılmş. Lütfen resim adını değiştirin veya farklı bir fotoğraf yükleyin !')->send();
                }
                $image->move(public_path('images/ormanevleri-room_gallery'),$imageName);
                Ormanevleri_room_gallery::create([
                    'room_id'=>$all['room_id'],
                    'image' => $imageName
                ]);
---
insert into `ormanevleri_room_galleries` (`room_id`, `image`, `updated_at`, `created_at`) values ('4', 'images/ormanevleri-room_gallery/312-02.jpg', '2023-03-01 13:34:56', '2023-03-01 13:34:56')

    public function delete($id, $room_id)
    {

        $image = Ormanevleri_room_gallery::find($id);
        $old_image = $image->image;
        unlink($old_image);

        $delete = Ormanevleri_room_gallery::find($id)->delete();
---
select * from `ormanevleri_room_galleries` where `ormanevleri_room_galleries`.`id` = '51' limit 1
delete from `ormanevleri_room_galleries` where `id` = 51