app/Http/Controllers/admin/OrmanEvleriRoomController.php

select * from `ormanevleri_rooms` order by `desk` asc
---
    public function index()
    {

        $data = Ormanevleri_room::orderBy('desk','asc')->get();

select * from `ormanevleri_rooms` where `ormanevleri_rooms`.`id` = '6' limit 1
---
    public function edit($id)
    {
        $data = Ormanevleri_room::find($id);

select * from `ormanevleri_rooms` where `ormanevleri_rooms`.`id` = '6' limit 1
update `ormanevleri_rooms` set `image` = 'images/room/389/16231.JPG', `ormanevleri_rooms`.`updated_at` = '2023-03-01 13:46:02' where `id` = 6
---
    public function update(Request $request,$id)
    {
        $all = $request->except('_token');
        $image = Ormanevleri_room::find($id);
        if($request->hasFile('image')){
            $old_image = $image->image;
            $old_big_image = \App\Helper\mHelper::largeImage($image['image']);
          	if(file_exists($old_image)){
              unlink($old_image);
            }
          	if(file_exists($old_big_image)){
              unlink($old_big_image);
            }

            $all['image'] = imageUpload::singleUpload(rand(1,9000),'room',$request->file('image'));
        }else{
            unset($all['image_one']);
        }


        $update = Ormanevleri_room::find($id)->update($all);