app/Http/Controllers/admin/RoomController.php

    public function index()
    {

        $data = Room::orderBy('desk','asc')->get();
---
select * from `rooms` order by `desk` asc