app/Http/Controllers/admin/ServiceController.php

    public function index()
    {
        $data = Service::all();
        $category_data = ServiceCategory::all();
---
select * from `services`
select * from `service_category`

    public function store(StoreSliderRequest $request)
    {
        // ===================================
        $all = $request->except('_token');

        if ($request->has('image')) {
            foreach ($request->file('image') as $image) {
                $imageName = "images/slider/" . rand(1, 999) . '-' . $image->getClientOriginalName();
                if (File::exists($imageName)) {
                    return redirect()->to('/admin/service/')->with('status', 'Aynı isimde daha önce yükleme işlemi yapılmış. Lütfen resim adını değiştirin veya farklı bir fotoğraf yükleyin !')->send();
                }
                $image->move(public_path('images/slider'), $imageName);

                Service::create([
                    'category_id' => $all['category_id'],
                    'image' => $imageName,
                ]);
---
insert into `services` (`category_id`, `image`, `updated_at`, `created_at`) values ('4', 'images/slider/857-wp2166981-morty-wallpapers.png', '2024-12-12 10:51:06', '2024-12-12 10:51:06')