app/Http/Controllers/admin/SliderController.php

select * from `slider_filter`
select * from `sliders` where `slider_id` = '12' order by `desk` asc
---
    public function index($id)
    {
        $filters = SliderFilter::all();
        $data = Slider::where('slider_id', $id)->orderBy('desk', 'asc')->get();

insert into `sliders` (`slider_id`, `image`, `slider_filter_id`, `updated_at`, `created_at`) values ('4', 'images/slider/643-3a739cdb50d02606c9ba5526290bcf85a4571fcfdda817fccc605c394afb7646.jpg', '[\"4\",\"5\"]', '2024-12-04 11:03:30', '2024-12-04 11:03:30')
insert into `sliders` (`slider_id`, `image`, `updated_at`, `created_at`) values ('4', 'images/slider/865-87-KARINNA112.jpg', '2024-12-04 17:47:17', '2024-12-04 17:47:17')
---
    public function store(StoreSliderRequest $request)
    {
        // ===================================
        $all = $request->except('_token');

        if ($request->has('image')) {
            foreach ($request->file('image') as $image) {
                $imageName = "images/slider/" . rand(1, 999) . '-' . $image->getClientOriginalName();
                if (File::exists($imageName)) {
                    return redirect()->to('/admin/slider/' . $all['slider_id'])->with('status', 'Aynı isimde daha önce yükleme işlemi yapılmış. Lütfen resim adını değiştirin veya farklı bir fotoğraf yükleyin !')->send();
                }
                $image->move(public_path('images/slider'), $imageName);

                // create slider
                // if ($all['slider_filter_id'] == 0) {
                //     $all['slider_filter_id'] = null;
                // }
                $selectedFilters = $request->input('filters');
                if (isset($selectedFilters) && count($selectedFilters) > 0) {
                    Slider::create([
                        'slider_id' => $all['slider_id'],
                        'image' => $imageName,
                        'slider_filter_id' => json_encode($selectedFilters)
                    ]);
                } else {
                    Slider::create([
                        'slider_id' => $all['slider_id'],
                        'image' => $imageName
                    ]);

select * from `sliders` where `sliders`.`id` = '4' limit 1
delete from `sliders` where `id` = '4'
---
    public function delete($id, $slider_id)
    {
        $image = Slider::find($id);
        $old_image = $image->image;
        unlink($old_image);

        $delete = Slider::where('id', $id)->delete();