app/Http/Controllers/admin/SliderController.php

insert into `sliders` (`slider_id`, `image`, `updated_at`, `created_at`) values ('12', 'images/slider/104-3a739cdb50d02606c9ba5526290bcf85a4571fcfdda817fccc605c394afb7646.jpg', '2024-12-03 14:26:59', '2024-12-03 14:26:59')
---
    public function store(StoreSliderRequest $request)
    {

        $all = $request->except('_token');

        if($request->has('image'))
        {
            foreach($request->file('image') as $image){
                $imageName = "images/slider/".rand(1,999).'-'.$image->getClientOriginalName();
                if(File::exists($imageName))
                {
                    return redirect()->to('/admin/slider/'.$all['slider_id'])->with('status','Aynı isimde daha önce yükleme işlemi yapılmış. Lütfen resim adını değiştirin veya farklı bir fotoğraf yükleyin !')->send();
                }
                $image->move(public_path('images/slider'),$imageName);
                Slider::create([
                    'slider_id'=>$all['slider_id'],
                    'image' => $imageName
                ]);