app/Http/Controllers/guest/HomeController.php

    public function foresthome()
    {
        $sliders = Slider::where('slider_id', 12)->get();
---
select * from `sliders` where `slider_id` = 12