app/Http/Controllers/guest/HomeController.php

    public function index()
    {
        $rooms = ActuRoom::where('preferred_room', 1)
            ->orderBy('created_at', 'desc')
            ->take(5)
            ->get();
        $titles = MainPageTitleSubtitle::all();
        $data = MainPageTitleSubtitle::first();
        $services = Service::all();
        $service_categories = ServiceCategory::all();
---
select * from `actu_rooms` where `preferred_room` = 1 and `actu_rooms`.`deleted_at` is null order by `created_at` desc limit 5
select * from `main_page_title_subtitle` limit 1
select * from `services`
select * from `service_category`

    public function foresthome()
    {
        $sliders = Slider::where('slider_id', 12)->get();
---
select * from `sliders` where `slider_id` = 4

    public function gallery()
    {
        $sliders = Slider::where('slider_id', 4)->get();
        $SliderFilters = SliderFilter::get();
---
select * from `slider_filter`

    public function reservation()
    {
        $rooms = ActuRoom::paginate(6);
---
select * from `actu_rooms` where `actu_rooms`.`deleted_at` is null
select count(*) as aggregate from `actu_rooms` where `actu_rooms`.`deleted_at` is null